[
  {
    "context": "The line graph below shows the percentage of people in Africa subscribing to mobile and fixed line phones from 1994 to 2004. Summarize the information by selecting and reporting the main features and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image182.png"
  },
  {
    "context": "The bar chart shows the percentage of young people in higher education in 2000, 2005 and 2010. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image32.png"
  },
  {
    "context": "The diagram below shows one way of manufacturing ceramic pots. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image105.png"
  },
  {
    "context": "The diagram below shows how to recycle organic waste to produce fertilizer (compost). Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image92.png"
  },
  {
    "context": "Some people argue job satisfaction is more important than job security. Others believe a permanent job is more important. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think news has no connection to people’s lives. So then it is a waste of time to read the newspaper and watch television news programs. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Advertisements are becoming more and more common in our everyday life. Is it a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Watching a live performance such as a play, concert, or sporting event is more enjoyable than watching the same event on television. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The chart below shows changes in the number of international students in Australia in 2019 and 2020. Summarize the information by selecting and reporting the main features and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image193.png"
  },
  {
    "context": "The table shows the export values of various products in 2009 and 2010. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image172.png"
  },
  {
    "context": "The plants show a student common room from five years ago and now. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image191.png"
  },
  {
    "context": "Many people believe that it is easier to have a healthy lifestyle in the countryside. Others believe that there are health benefits of living in cities. Discuss both views and give your opinions.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think young people should follow the traditions of their society. Others think that they should be free to behave as individuals. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people say free time activities for children should be organized by parents. Others say that children should be free to choose what they do in their free time. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that it is best to encourage children to have a healthy diet at school while others believe that parents should be the ones to teach children to have a healthy diet. Discuss both views and give your opinion",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The bar chart shows the percentage of small , medium, large companies which used social media for business purposes between 2012 to 2016. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image140.png"
  },
  {
    "context": "The illustration shows information about how an igloo is built from snow.  Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image76.png"
  },
  {
    "context": "The flow chart below shows the procedures to get a driving license in US.  Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image144.png"
  },
  {
    "context": "The charts below show the performance of a bus company in terms of punctuality, both actual and target (what actually happened compared to what the company was trying to achieve), and the number of complaints and passengers.  Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image49.png"
  },
  {
    "context": "The maps below show the changes in a town after the construction of a hydroelectric power dam. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image37.png"
  },
  {
    "context": "The world of work is rapidly changing and employees cannot depend on having the same job or the same working conditions for life. Why is it the case? Can you suggest some ways to prepare people to work in the future?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think movies should only be for entertainment. Others think that they should also have educational values. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In some countries, small town-centre shops are going out of business because people tend to drive to large out-of-town stores. As a result, people without cars have limited access to out-of-town stores, and it may result in an increase in the use of cars. Do you think the disadvantages of this change outweigh its advantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In the future, it is expected that there will be a higher proportion of older people in some countries. Is this positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The charts below show the percentage of people working in different sectors in town A and town B in 1960, 2010. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image72.png"
  },
  {
    "context": "The table below gives information about values of the exports of kiwi fruit from New Zealand to five countries between 2010 and 2012. (Unit: NZ$) Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image12.png"
  },
  {
    "context": "The bar chart below shows the amount of money invested in each category from five organisations. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image130.png"
  },
  {
    "context": "The map below shows the changes that have taken place at the waterfront area of a town called Darwin between 2009 and 2014. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image146.png"
  },
  {
    "context": "People are having more and more sugar-based drinks. What are the reasons? What are the solutions to make people drink less?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The use of social media is replacing face-to-face interaction among many people in society. Do you think the advantages outweigh the advantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that reading stories from a book is better than watching TV or playing computer games for children. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Online shopping is increasing dramatically. How could this trend affect our environment and the kinks of jobs required?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The table below shows the number of vehicles registered in Australia in 2010, 2012 and 2014. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image206.png"
  },
  {
    "context": "The chart below gives information about the age of women in Australia when they give birth to their first child in 1966, 1986 and 2006. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image28.png"
  },
  {
    "context": "The line graph shows the percentage of New Zealand population from 1950 to 2050. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image159.png"
  },
  {
    "context": "The diagram below shows how ethanol fuel is produced from corn. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image123.png"
  },
  {
    "context": "Today, TV channels broadcast more men's sport shows than women’s sport shows. Why? Should TV channels give equal showtime for women’s sport and men’s sport?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Spoken communication is more powerful than written communication. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Films were produced by big companies in the past, but today people are able to make a film. Do you think this trend is positive or negative?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Is mental strength important for success in sports or is it more important to have strong and fit people in sports? Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The graph below shows the number of inquiries received by the Tourist Information Office in one city over a six-month period in 2011. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image62.png"
  },
  {
    "context": "The table shows the number of employees and factories producing silk in England and Wales between 1851 and 1901. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image58.png"
  },
  {
    "context": "The bar chart shows the percentage of people going to cinemas in one European country on different days. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image81.png"
  },
  {
    "context": "The diagram below shows how orange juice is produced. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image83.png"
  },
  {
    "context": "Some people think that it is more beneficial to take part in sports which are played in teams, like football, while other people think that taking part in individual sports, like tennis or swimming, is better. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "People living in large cities today face many problems in their everyday life. What are these problems? Should governments encourage people to move to smaller regional towns?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Maintaining public libraries is a waste of money since computer technology can replace their functions. Do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Research shows that business meetings, discussions, and training are happening online nowadays. Do the advantages outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image17.png"
  },
  {
    "context": "The table shows the proportion of female and male aged 15 and aged 75 from 1911 to 2001 in the UK. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image149.png"
  },
  {
    "context": "It is better for college students to live far away from home than live at home with their parents. Do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Government should invest more money in science education rather than other subjects to develop the country. Do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think international car-free days are an effective way of reducing air pollution; however, others think there are other ways. Discuss both views and give your opinion",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The diagram shows how chocolate is produced. Summarize the information by selecting and reporting the main features and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image55.png"
  },
  {
    "context": "The chart below shows the results of a British survey taken in 2005 related to the housing preferences of people in the UK. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image199.png"
  },
  {
    "context": "The graphs below show the cinema attendance in Australia and the average cinema visits by different age groups from 1996 to 2000. Summarize the information by selecting and reporting the main features and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image177.png"
  },
  {
    "context": "The plans show the change of a small theater in 2010 and 2012. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image67.png"
  },
  {
    "context": "Some people think that organizing international sports events is good for the host country while others think it is bad. Discuss both views and state your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think students should study the science of food and how to prepare it. Others think students should spend time on other important subjects. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some countries allow old people to work to any age that they want. Do the advantages outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In some countries, more and more adults continue to live with their parents even after they have completed education and found jobs. Do the advantages outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The chart shows the average daily minimum and maximum levels of air pollutants in 4 cities in 2000. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image41.png"
  },
  {
    "context": "The chart shows the proportion of renewable energy in total energy supply in 4 countries from 1997 to 2010. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. Write at least 150 words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image48.png"
  },
  {
    "context": "The charts show the sources of electricity produced in 4 countries between 2003 and 2008. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_tasks/images/image103.png"
  },
  {
    "context": "Some universities offer online courses as an alternative to classes delivered on campus. Do you think this is a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is neither possible nor useful for a country to provide university places for a high proportion of young people. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In schools and universities, girls tend to choose arts while boys like science. What are the reasons for this trend and do you think this tendency should be changed?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays young people spend too much of their free time in shopping malls. Some people fear that this may have negative effects on young people and the society they live in. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The graph below shows the number of university graduates in Canada from 1992 to 2007. Summarise the information by selecting and reporting the main features and make comparisons where relevant. You should spend about  20  minutes on this task. You should write at least  150  words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/iot_media/img/2018-06_RAT1-PT2-1.jpg"
  },
  {
    "context": "Write about the following topic. Some organisations believe that their employees should dress smartly. Others value quality of work above appearance. Discuss both these views and give your own opinion. Give reasons for your answer and include any relevant examples from your own knowledge or experience. You should spend about  40  minutes on this task. You should write at least  250  words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/iot_media/img/2020-12_xRAT1-PT2-2.jpg.pagespeed.ic.LowJTXDUrE.jpg"
  },
  {
    "context": "The table below shows the table made by a coffee shop in an office building on a typical weekday. Summarize the information by selecting and reporting the main features, and make comparisons where relevant. You should spend about  20  minutes on this task. You should write at least  150  words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/iot_media/img/2020-12_xRAT4,P20W5.jpg.pagespeed.ic.mOPJqw5Pmu.jpg"
  },
  {
    "context": "Write about the following topic. More and more people are relying on the private car as their major means of transportation. Describe some of the problems over-reliance on cars can cause, and suggest at least one possible solution. Give reasons for your answer and include any relevant examples from your own knowledge or experience. You should spend about  40  minutes on this task. You should write at least  250  words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/iot_media/img/2020-12_xrat4-pt5-2.jpg.pagespeed.ic.NxTjcNEFCz.jpg"
  },
  {
    "context": "The climograph below shows average monthly temperatures and rainfall in the city of Kolkata. Summarise the information by selecting and reporting the main features and make comparisons where relevant. You should spend about  20  minutes on this task. You should write at least  150  words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/iot_media/img/2019-08_xRAT4,P20W1_0.jpg.pagespeed.ic.OoBdCEnbLr.jpg"
  },
  {
    "context": "Write about the following topic. It is now possible for scientists and tourists to travel to remote natural environment, such as the South Pole. What are advantages and disadvantages of this development? Give reasons for your answer and include any relevant examples from your own knowledge or experience. You should spend about  40  minutes on this task. You should write at least  250  words.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/iot_media/img/2018-06_rat4-pt1-2.jpg"
  },
  {
    "context": "It is important for all towns and cities to have large public outdoor places like squares and parks. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Restoration of old buildings in many cities involves enormous government expenditure. It would be more beneficial to spend this money to build new houses and roads. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is not necessary to travel to other places to learn about the culture of other people. We can learn just as much from books, films, and the internet. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many employers believe that good social skills are as important as good qualifications to succeed in a job, so they are employing people who have good social skills. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that they should be able to keep all the money they earn, and should not have to pay tax to the state. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that the main purpose of schools is to turn children into good citizens and workers, rather than to benefit them as individuals. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The best way to solve the traffic and transportation problem is to encourage people to live in cities rather than suburbs or the countryside. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Rich countries often give financial aid to poor countries, but it does not solve poverty. So rich countries should give other types of help to poor countries rather than financial aid. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The key to solving the environmental problem is simple: the present generation is willing to accept a less comfortable life for the sake of the future generation. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The most important aim of science should be to improve people’s lives. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The best way for a government to prepare for the future is to invest in young people. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think news has no connection to people’s lives. So then it is a waste of time to read the newspaper and watch television news programs. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Any country should be able to sell goods to other countries without the restrictions of the government. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many animals are endangered. Some people argue that we should only protect animals that are useful to humans. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays there is a growing amount of advertising aimed at children. Some people think this has negative effects on children and should be banned. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "When a new town is planned, it is more important to develop public parks and sports facilities than shopping centers for people to spend their free time in. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that shops should not be allowed to sell food or drinks that are scientifically proven to be bad for people's health. Do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Pollution and other environmental problems are resulting from a country's development and becoming richer. Some think this cannot be avoided. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The advantages of the spread of English as a global language will continue to outweigh its disadvantages. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that mobile phones should be banned in public places like libraries, shops, and on public transport. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "More government investment should be in the teaching of science than any other subjects in order to keep a country's development and progress. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The international community must act immediately to ensure all nations reduce their consumption of fossil fuels e.g. gas and oil. To what extent do you agree or disagree?​",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people say that too much attention and too many resources are given to the protection of wild animals and birds. Do you agree or disagree with this opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that planning for the future is a waste of time because they think that focusing on the present is more important. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is the responsibility of schools to teach good behavior in addition to providing formal education. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In some countries unemployment is high, so some people think that children should only go to primary school and not to secondary school because they will not be able to find jobs in the future. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "People’s shopping habits depend more on the age group they belong to than any other factor. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Good teaching is more important for academic success than individual ability. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "More and more people are using computers and electrical devices to access information. Therefore there is no need to print books, magazines, and newspapers on paper. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Historical objects should be brought back to their country of origin. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "There have been many inventions in human history, such as the wheel. Some people think the most important invention is the Internet. To what extent do you agree or disagree with this opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Study shows that many criminals have low levels of education. For this reason, some people believe that the best way to reduce crime is to educate people in prison so that they can get a job when they leave prison. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays some people claim that public museums and art galleries will not be needed because people can see historical objects and works of art by using a computer. To what extent do you agree or disagree with this opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Scientific research should be carried out and controlled by the government rather than private companies. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people claim that employers should not be concerned about how employees dress, but only about the quality of their work. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some experts think that all students should learn musical instruments. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people say that it is unnecessary to teach children handwriting at school. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some psychologists recommend that doing absolutely nothing at all for a period of time during the day is the best way to overcome stress. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "All fathers should be entitled to time off from work when their children are born. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that young people who commit serious crimes should be punished in the same way as adults. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "4. Living in a country where you have to speak a foreign language can cause serious social problems, as well as practical problems. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "5. Some people believe that nowadays we have too many choices. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "8. Some individuals prefer temporary employment, which allows them to work only a few months each year and dedicate the remaining time to pursuing their interests. What is your opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "9. It has been observed that nations with longer average working hours tend to have greater economic success compared to those with shorter working hours. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "12. Financial education should be included as a mandatory subject in schools to prepare students for managing money effectively. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "17. Some argue that music mainly serves as a way for individuals to reduce their stress and anxiety. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Wild animals have no place in the 21st century, so protecting them is a waste of resources. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays more and more people want to get things done instantly (services, information, tasks). Why is this? Do you think it is a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many scientists believe that now we can study the behavior of a three-year-old child to see whether they will grow up to be criminals. To what extent do you think crime is determined by human nature? Is it possible to stop children from growing up to be criminals?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The demand for food is increasing worldwide. What are the causes? What measures could the international community take in order to improve the situation?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people aspire to a balance between work and other parts of their lives, but few achieve it. What are the problems in trying to achieve this and how can these problems be overcome?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some parents give their children everything that their children ask for and accept what their children want to do. Is this good for children? What could be the consequences for these children when they grow up?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people like to eat unhealthy food even though they know it's bad for them. Why is this? What is an effective way to improve people's healthy eating habits?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In both education and employment, some people work harder than others. Why do some people work harder than others? Is working hard always a good thing?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Young people today know more about international pop and film stars than they do about famous people in their own country's history. Why is this? What can be done to increase young people's interest in famous people from their country's history?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "During holidays or weekends, young people spend less time on outdoor activities in the natural environment, such as hiking and mountain climbing. Why? What can be done to encourage them to go out?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "An American film actor John Wayne said: “Tomorrow is the most important thing in life.\" How is it important for individuals and countries to think about the future rather than focus on the present? What's your opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays, some parents put a lot of pressure on their children. What is the reason for this? Is this a positive or negative development for the children?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays, cars and motorcycles make transport increasingly difficult. Why do people continue to use them? What is the best way to stop people from using cars and motorcycles in cities?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "More and more plastic waste is polluting the world’s cities, countryside, and oceans. What problems will it cause? What measures should be taken to solve these problems?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Health experts claim that walking is the best exercise. However, people are walking less on a daily basis. What has caused this? What can be done about it?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays more and more people want to get things done instantly (Services, information, tasks). Why is this? Do you think this is a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many schools, girls tend to study arts subjects and boys tend to study science subjects. What are the possible reasons and should the tendency be changed?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many museums and historical sites are mainly visited by tourists but not by local people. Why is this the case and what can be done to attract more local people to visit these places?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Fresh water is a limited resource in some parts of the world. Today, increasing demand has made it a global problem. What are the causes of this growing demand? What can governments and individuals do to respond to the problem?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries, students leave school with no understanding of how to manage their money. Why is this the case? What can be done to improve students' understanding of personal finance management?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Now  many people spend less and less time at home. What are the causes for this? What are the effects of this on individuals and on society?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some countries have an ever-increasing proportion of the population who are aged 15 and younger. What is your opinion of the current and future effects it may have in those countries?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "1. In some countries, the government fully funds all university courses while in others, students have to pay for their own education. Discuss the advantages and disadvantages of each approach and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "2. Many people believe that the gap between rich and poor is widening. What problems can this create for society and what measures can be taken to tackle this issue?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "3. In some countries, the voting age is 16 while in others, it is 18 or higher. Discuss the advantages and disadvantages of a lower voting age and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In recent years, there has been a rise in the use of performance-enhancing drugs in sports. What are the consequences of doping for athletes? What measures should be taken to combat this issue?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "15. The rise of social media platforms has made it easier for people to vent their frustrations and complaints publicly. What is the consequence of this trend? Is there any benefit to expressing complaints on social media?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people feel it is a waste of money to try to save endangered animal species, for example the tiger or the blue whale. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "‘A country’s museums should always be free for people to visit, whatever the visitor’s age, income or nationality.’ To what level do you agree with this idea? Should museums always be free for all visitors?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "As well as making money, businesses also have social responsibilities. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people who have been in prison become good citizens later, and it is often argued that these are the best people to talk to teenagers about the dangers of committing a crime. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that unpaid community service should be a compulsory part of high school programmes (for example working for a charity, improving the neighbourhood or teaching sports to younger children). To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The Internet will never replace traditional course books in schools.’ How far do you agree with this prediction?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Families who send their children to private schools should not be required to pay taxes that support the state education system. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Universities should accept equal numbers of male and female students in every subject. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "‘For all children, the ability to play a musical instrument is just as important as the ability to read and write.’ How far do you agree with this suggestion? How important is it for a child to learn to play a musical instrument, in your view?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that it is more important to teach children the literature and history of their own country, rather than the literature and history of other countries. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In some countries it is thought advisable that children begin formal education at four years old, while in others they do not have to start school until they are seven or eight. How far do you agree with either of these views?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Caring for children is probably the most important job in any society. Because of this, all mothers and fathers should be required to take a course that prepares them to be good parents. To what extent do you agree or disagree with this view?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that instead of preventing climate change, we need to find a way to live with it. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "We cannot help everyone in the world that needs help, so we should only be concerned with our own communities and countries. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "‘The use of software makes it unnecessary for people to know how to spell words correctly these days.’ Is this a statement that you agree with? To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that hobbies need to be difficult to be enjoyable. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Extreme sports such as sky diving and skiing are very dangerous and should be banned. To what extent do you agree or disagree with this view?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Popular hobbies and interests change over time and are more a reflection of trends and fashions than an indication of what individuals really want to do in their spare time. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In the past, shopping was a routine domestic task. Many people nowadays regard it as a hobby. To what extent do you think this is a positive trend?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Although more and more people read news on the Internet, newspapers will remain the most important source of news. Do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays celebrities are more famous for their glamour and wealth than for their achievements, and this sets a bad example to young people. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The older generations tend to have very traditional ideas about how people should live, think and behave. However, some people believe that these ideas are not helpful in preparing younger generations for modern life. To what extent do you agree or disagree with this view?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In recent years, there has been growing interest in the relationship between equality and personal achievement. Some people believe that individuals can achieve more in egalitarian societies. Others believe that high levels of personal achievement are possible only if individuals are free to succeed or fail according to their individual merits. What is your view of the relationship between equality and personal success?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is inevitable that traditional cultures will be lost as technology develops. Technology and traditional cultures are incompatible. To what extent do you agree or disagree with this view?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Most people have forgotten the meaning behind traditional or religious festivals; during festival periods, people nowadays only want to enjoy themselves. To what extent do you agree or disagree with this opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some observers say that police officers should be recruited from the communities where they work, so that they have local knowledge. Other people say that this is unnecessary, or even undesirable. Where do you stand on this debate? Is local knowledge essential in modern policing?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that nowadays we have too many choices. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Scientific developments in farming always bring major benefits. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The money spent by governments on space programmes would be better spent on vital public services such as schools and hospitals. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Foreign visitors should pay more than local visitors for cultural and historical attractions. To what extent do you agree or disagree with this opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "When choosing a job, the salary is the most important consideration. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that all teenagers should be required to do unpaid work in their free time to help the local community. They believe this would benefit both the individual teenager and society as a whole. Do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "‘People who do not use social media networks will always fall behind in career development opportunities.’ To what extent do you feel that this is an accurate and important prediction? (Social media networks = messaging and information exchange systems such as Facebook and Twitter.)",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Today, the high sales of popular consumer goods reflect the power of advertising and not the real needs of the society in which they are sold. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think it is important to construct new buildings rather than wasting money on maintaining old ones. To what extent do you agree or disagree with this opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries, truancy * is a worrying problem for both parents and educators. What are the causes of truancy, and what may be the effects on the child and the wider community? (* truancy = the situation when a child pretends to go to school but in fact goes somewhere else, for example to play unsupervised. The verb is ‘to play truant from school.’)",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is important for children to learn the difference between right and wrong at an early age. Punishment is necessary to help them learn this distinction. To what extent do you agree or disagree with this opinion? What sort of punishment should parents and teachers be allowed to use to teach good behaviour to children?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "These days more fathers stay at home and take care of their children while mothers go out to work. What could be the reasons for this? Do you think it is a positive or a negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Explain some of the ways in which humans are damaging the environment. What can governments do to address these problems? What can individual people do?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people today are worried about the large quantities of waste produced by ordinary households. What problems are caused by household waste, and what solutions may be possible in both the short and the long term?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Unemployment remains the biggest challenge to school-leavers in most countries’ How far do you agree with this assessment? What other challenges face young people today? (school-leavers = young people who leave school without going on to further studies.)",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays the way many people interact with each other has changed because of technology. In what ways has technology affected the types of relationships that people make? Has this been a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many doctors are concerned about the high use of computer games by children and young people. What mental and physical problems may arise from excessive use of these games? How could these problems be reduced?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people prefer to watch foreign films rather than locally produced films. Why could this be? Should governments give more financial support to local film industries?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "News editors decide what to broadcast on television and what to print in newspapers. What factors do you think influence these decisions? Do we become used to bad news, and would it be better if more good news was reported?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "There are many different types of music in the world today. Why do we need music? Is the traditional music of a country more important than the international music that is heard everywhere nowadays?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Happiness is considered very important in life. Why is it difficult to define? What factors are important in achieving happiness?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "More and more people are migrating to cities in search of a better life, but city life can be extremely difficult. Explain some of the difficulties of living in a city. How can governments make urban life better for everyone?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In the developed world, average life expectancy is increasing. What problems will this cause for individuals and society? Suggest some measures that could be taken to reduce the impact of ageing populations.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries, traditional dress and costumes are considered effective ways of maintaining links with the past. How effective can traditional costumes be, in this sense? What other ways exist to help citizens connect with a country’s past?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The use of phones, tablets and other devices when people are walking in public is causing concern among many commentators. What dangers may arise when people focus on such devices when walking in the street? How could these problems be reduced?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people nowadays spend a large part of their free time using a smartphone. What do you think are the reasons for this? Do you think this is a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Increasing the price of petrol is the best way to solve growing traffic and pollution problems. To what extent do you agree or disagree? What other measures do you think might be effective?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Pollution of rivers, lakes and seas is a major concern for people who seek to protect the environment. What are the possible causes of water pollution, and what effects does this have on animal life and human society?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "As most people spend a major part of their adult life at work, job satisfaction is an important element of individual wellbeing. What factor contributes to job satisfaction? How realistic is the expectation of job satisfaction for all workers?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people decide on a career path early in their lives and keep to it. This, they argue, leads to a more satisfying working life. To what extent do you agree with this view? What other things can people do in order to have a satisfying working life?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "‘Knowing how to make a group presentation is the most important skill for anyone in the world of work today.’ How important are presentation and public speaking skills, compared to various other work skills? Which skill is the most important ability for most people these days?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The graph shows the percentage of male and female academic staff members across the faculties of a major university in 2012. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/gg_imgs/test/d2921593dd4a1fafc4ec80173f9d265b630f78a5.jpg"
  },
  {
    "context": "Solar energy is becoming more and more popular as a source of household energy in many countries around the world.   Why is this? What are the advantages and disadvantages of solar energy?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that it is best to live in a horizontal city while others think of a vertical city. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that studying at university or college is the best route to a successful career, while others believe that it is better to get a job straight after school. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think zoos are cruel and all zoos should be closed. However, some people think zoos can help protect rare animals. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe teenagers should focus on all subjects equally, whereas others think that they should concentrate only on subjects they find interesting. Discuss both views and provide your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many companies sponsor sports as a way to advertise themselves. Some people think this is good for the world of sports, while others think there are disadvantages of this. Discuss both sides and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that children should do organized activities in their free time while others believe that children should be free to do what they want to do in their free time. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think climate change has a negative impact on business, while others think that it provides more business opportunities. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Human activities have negative effects on plant and animal species. Some people think it is too late to do anything about this problem. Others believe effective measures can be taken to improve this situation. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think it is more beneficial to play sports that are played in teams, e.g. football. And some people think individual sports, e.g. tennis and swimming, are better. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some university students want to learn about other subjects in addition to their main subjects. Others believe it is more important to give all their time and attention to studying for a qualification. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people say that drug companies have a responsibility to spend money on researching medicines that will help people in poorer countries. Others say the main responsibility of drug companies is to make money. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think the government should establish free libraries in each town. Others believe that it is a waste of money since people can access the Internet to obtain information. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that children have the freedom to make mistakes, while others argue that adults should prevent them from doing so. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that cultural traditions may be destroyed when they are used as money-making attractions aimed at tourists. Others believe it is the only way to save these traditions. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think parents should read or tell stories to children. Others think parents needn't do that as children can read books or watch TV, or movies by themselves. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that young people should follow the traditions of society. Others think young people are free to behave as individuals. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think it is better for one single legal system throughout the world. Others say countries should have their own laws. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think visual images (e.g. photographs, videos) in a news story can accurately tell what happened. Others think it cannot tell the full news story. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In big organizations, directors now have higher salaries than ordinary workers. Some people say this is necessary, while others say it is unfair. Discuss both views & give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people feel that manufacturers and supermarkets have the responsibility to reduce the amount of packaging of goods while others argue that customers should avoid buying goods with a lot of packaging. Discuss both views and give your opinion",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "7. Regarding environmental issues, some people believe they are too vast for individuals to tackle. Conversely, others argue that these problems cannot be solved unless individuals take action. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "10. The opinion on preserving endangered languages varies; while some believe that governments should invest in saving them, others consider it a wasteful expenditure. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "11. Some people argue that young people are unfit for holding significant positions in the government, while others maintain that it is beneficial for them to occupy such roles. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "13. Some people think that manufacturers and shopping malls should sell fewer packaged products while others argue that people have the responsibility to buy products with less packaging. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that professional athletes serve as positive role models for young people, while others argue that their behavior both on and off the field can have a negative influence. Discuss both sides and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays animal experiments are widely used to develop new medicines and to test the safety of other products. Some people argue that these experiments should be banned because it is morally wrong to cause animals to suffer, while others are in favour of them because of their benefits to humanity. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that museums should be enjoyable places to entertain people, while others believe that the purpose of museums is to educate. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that strict punishments for driving offences are the key to reducing traffic accidents. Others, however, believe that other measures would be more effective in improving road safety. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many governments think that economic progress is their most important goal. Some people, however, think that other types of progress are equally important for a country. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people feel that governments should take a large proportion of people's salaries to pay for necessary public services such as roads and schools. Others feel that high taxes are a bad thing. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that all university students should study whatever they like. Others believe that they should only be allowed to study subjects that will be useful in the future, such as those related to science and technology. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that a sense of competition in children should be encouraged. Others believe that children who are taught to co-operate rather than compete become more useful adults. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that parents should teach children how to be good members of society. Others, however, believe that school is the place to learn this. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is generally believed that some people are born with certain talents, for instance for sport or music, and others are not. However, it is sometimes claimed that any child can be taught to become a good sports person or musician. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some commentators feel that grandparents should live together with their children and grandchildren, while others say that elderly people should be encouraged to live independently. Consider the possible arguments on both sides of this debate, and reach your own conclusion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that children should spend all of their free time with their families. Others believe that this is unnecessary or even negative. Discuss the possible arguments on both sides, and say which side you personally support.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people say that the main environmental problem of our time is the loss of particular species of plants and animals. Others say that there are more important environmental problems. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is sometimes said that governments should dedicate a fixed proportion of their country’s income to foreign aid each year, and this fixed proportion should always be donated to other countries. Opponents of this idea, however, say that aid should have no fixed proportion, and help should only be sent to other countries at times when it is really needed. What are the arguments on both sides of this debate? What is your own view on the matter?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people say that the best way to improve public health is by increasing the number of sports facilities. Others, however, say that this would have little effect on public health and that other measures are required. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is generally believed that the Internet is an excellent means of communication but some people suggest that it may not be the best place to find information. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Several languages are in danger of extinction because they are spoken by very small numbers of people. Some people say that governments should spend public money on saving these languages, while others believe that would be a waste of money. Discuss both these views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that governments should give financial support to creative artists such as painters and musicians. Others believe that creative artists should be funded by alternative sources. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is difficult for people living in cities to get enough physical exercise. What are the causes and what solutions can be taken to solve the problem?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The practice of illegally hunting wild animals continues to cause concern in many countries, particularly developing countries. What are the causes of such hunting? What are the effects on the animals, and on the wider human society in these countries and beyond?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries schools have severe problems with student behaviour. What do you think are the causes of this? What solutions can you suggest?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Light pollution (excessive light during night time) is a form of pollution that distresses many people, especially in modern cities. What are the causes of light pollution, and what solutions can you suggest for governments and businesses to take?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Transport delays and long journey times are a widespread phenomenon in many cities today. What are the causes of this problem, and how could the situation be improved?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many parts of the world, children and teenagers are spending more and more of their time indoors. What do you think are the causes of this problem? What measures could best be taken to solve it?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Traffic congestion is becoming increasingly problematic in major cities. What solutions can you suggest to help solve the problem?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In spite of the advances made in agriculture, many people around the world still go hungry. Why is this the case? What can be done about this problem?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that in the modern world we are more dependent on each other, while others think that people have become more independent. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is sometimes said that the countryside offers a high quality of life, especially for families. What are the arguments for and against families choosing to live and work in the countryside, for example as farmers? What is your own view about this?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people feel that the exploration of space justifies a large amount of government and private investment. Other people think that this field is of increasingly low relevance, and should not be a priority. Debate both sides of this discussion, and explain your own view. How important is it for us to explore space at the moment?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some governments today seek to monitor the general public’s electronic communications (in the form of phone calls, texts and emails) saying that this reduces crime. Many people oppose this, however, saying that it erodes individual freedoms. Discuss the aspects of this debate, and give your own conclusion to the discussion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Genetic engineering is an important issue in society today. Some people think that it will improve people’s lives in many ways. Others feel that it may be a threat to life on earth. Discuss both these views and give your own opinion",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that developments in the field of artificial intelligence will have a positive impact on our lives in the near future. Others, by contrast, are worried that we are not prepared for a world in which computers are more intelligent than humans. Discuss both of these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that studying at university or college is the best route to a successful career, while others believe that it is better to get a job straight after school. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries, a small number of people earn extremely high salaries. Some people believe that this is good for the country, but others think that governments should not allow salaries above a certain level. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some employers offer their employees subsidised membership of gyms and sports clubs, believing that this will make their staff healthier and thus more effective at work. Other employers see no benefit in doing so. Consider the arguments from both aspects of this possible debate, and reach a conclusion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some employers are willing to give their workers a certain amount of unpaid sabbatical* time, believing this benefits the individual and the organisation. Other employers see no merit in this arrangement and discourage it. Consider the possible arguments for and against unpaid sabbatical leave, and reach a viewpoint of your own. (* unpaid sabbatical time or leave = extended, unpaid time off work, in which an employee can follow personal interests or studies, and then return to work)",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people argue that it is more important to have an enjoyable job than to earn a lot of money. Others disagree and think that a good salary leads to a better life. Discuss both these views and give your own opinion",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people choose to eat no meat or fish. They believe that this is not only better for their own health but also benefits the world as a whole. Discuss this view and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The picture below shows how a hot balloon works. Summarize the information by selecting and reporting the main features.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image11.png"
  },
  {
    "context": "The diagram shows the design of a modern landfill for household waste. Summarize the information by selecting and reporting the main features and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image8.png"
  },
  {
    "context": "The diagram below shows the development of cutting tools in the Stone Age. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image4.png"
  },
  {
    "context": "The diagram below shows the development of the horse over a period of 40 million years. The evolution of the horse, with particular emphasis on the changing foot structure. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image5.png"
  },
  {
    "context": "The diagram below shows the process of making soft cheese. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image1.png"
  },
  {
    "context": "The diagram below shows the life cycle of a salmon, from egg to adult fish.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image22.png"
  },
  {
    "context": "The diagram below shows the life cycle of the honey bee. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image99.png"
  },
  {
    "context": "The diagrams below show some principles of house design for cool and for warm climates. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image72.png"
  },
  {
    "context": "The diagram below shows the water cycle, which is the continuous movement of water on, above and below the surface of the Earth. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image59.png"
  },
  {
    "context": "The diagram below shows how the Australian Bureau of Meteorology collects up-to-the-minute information on the weather in order to produce reliable forecasts. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image38.png"
  },
  {
    "context": "The chart below shows the process of waste paper recycling. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image50.png"
  },
  {
    "context": "The diagrams below show how houses can be protected in areas which are prone to flooding. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image48.png"
  },
  {
    "context": "The diagram below shows how solar panels can be used to provide electricity for domestic use. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image33.png"
  },
  {
    "context": "The diagram below shows the life cycle of the butterfly. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image98.png"
  },
  {
    "context": "The diagram below shows the process by which bricks are manufactured for the building industry. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image61.png"
  },
  {
    "context": "The illustrations below show how chocolate is produced. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image31.png"
  },
  {
    "context": "The diagram below shows the floor plan of a public library 20 years ago and how it looks now. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image9.png"
  },
  {
    "context": "The map below is of the town of Garlsdon. A new supermarket(S) is planned for the town. The map shows two possible sites for the supermarket. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image18.png"
  },
  {
    "context": "The two maps below show an island, before and after the construction of some tourist facilities. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image10.png"
  },
  {
    "context": "The diagrams below show the site of a school in 2004 and the plan for changes to the school site in 2024. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image1.png"
  },
  {
    "context": "The map shows the growth of a village called Chorleywood between 1868 and 1994.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image24.png"
  },
  {
    "context": "The diagrams are the existing and proposed floor plans for the redevelopment of an art gallery. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image36.png"
  },
  {
    "context": "The civic centre will be planned to change. There are two maps: one is the existing and the other is the plan for new. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image13.png"
  },
  {
    "context": "The chart below shows the number of households in the US by their annual income in 2007, 2011, and 2015. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image10.png"
  },
  {
    "context": "The charts below show internet use for different purposes in Australia in 2010 and 2011 and the percentage by users. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image3.png"
  },
  {
    "context": "The chart above shows information about various professions in the U.K. and their salaries. The table shows the average working hours per week for each profession. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_2023/images/image7.png"
  },
  {
    "context": "The chart below shows the amount of time that 10 to 15-year-olds spend chatting on the Internet and playing on games consoles on an average school day in the UK. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image51.png"
  },
  {
    "context": "The chart below shows the amount spent on six consumer goods in four European countries. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image40.png"
  },
  {
    "context": "The charts below show the levels of participation in education and science in developing and industrialised countries in 1980 and 1990. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image85.png"
  },
  {
    "context": "The charts below show the main reasons for study among students of different age groups and the amount of support they received from employers. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image79.png"
  },
  {
    "context": "The chart below shows numbers of incidents and injuries per 100 million passenger miles travelled (PMT) by transportation type in 2002. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image69.png"
  },
  {
    "context": "The chart below shows average weekly household expenditure by region, 2007-09. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image5.png"
  },
  {
    "context": "The chart below shows the total number of Olympic medals won by twelve different countries.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image63.png"
  },
  {
    "context": "The bar graph shows the global sales (in billions of dollars) of different types of digital games between 2000 and 2006. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image92.png"
  },
  {
    "context": "The graph below presents the information about Nathan's Hot Dog Eating Contest in Brooklyn's Coney Island, USA. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image74.png"
  },
  {
    "context": "The charts below compare the age structure of the populations of France and India in 1984. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image81.png"
  },
  {
    "context": "The chart below shows the total number of minutes (in billions) of telephone calls in the UK, divided into three categories, from 1995- 2002. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image67.png"
  },
  {
    "context": "The graphs below summarise the results of a survey carried out by the Department of Health about the overweight population in Britain with projections. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image71.png"
  },
  {
    "context": "The diagrams provide some information about the housing prices of five cities around the world from 1990 to 2000. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image86.png"
  },
  {
    "context": "The first chart below shows the number of airline crew (pilots, stewards etc) needed to fly a passenger plane between Australia and a number of other countries. The second chart shows the number of passenger complaints per plane journey made on these routes, and average kilogram (kg) weight of luggage (or baggage) carried per passenger. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image44.png"
  },
  {
    "context": "The bar charts below provide information about percentages of students who are proficient in a foreign language in different countries.  Summarize the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/gg_imgs/test/704392d68e7a1996616641cd6eedffef8624eea0.jpg"
  },
  {
    "context": "The chart below shows the results of a survey of people who visited four types of tourist attraction in Britain in the year 1999. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image94.png"
  },
  {
    "context": "The charts below show the results of a questionnaire that asked visitors to the Parkway Hotel how they rated the hotel's customer service. The same questionnaire was given to 100 guests in the years 2005 and 2010. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image14.png"
  },
  {
    "context": "The pie charts below compare water usage in San Diego, California and the rest of the world. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image15.png"
  },
  {
    "context": "The pie charts below show units of electricity production by fuel source in Australia and France in 1980 and 2000. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image32.png"
  },
  {
    "context": "The three pie charts below show the changes in annual spending by a particular UK school in 1981, 1991 and 2001. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image54.png"
  },
  {
    "context": "The pie charts below show how dangerous waste products are dealt with in three countries. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_essay/images/image2.png"
  },
  {
    "context": "The table below shows the percentage of first year students who gave ‘very good’ rating to the resources provided by the college, for three courses. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The table below shows population figures for 4 countries for 2003 and projected figures for 2025 and 2050. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image12.png"
  },
  {
    "context": "The chart below compares the percentage of time Australian mothers and fathers spent helping their children with four activities in 2013.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/gg_imgs/test/ea6496b77cf0b2f9120d22a3c6d531678fe8869e.jpg"
  },
  {
    "context": "The line chart shows the trends of employment in the USA and predictions for the future. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image26.jpg"
  },
  {
    "context": "The charts below show the percentage of Australian men and women in three age groups who were employed in 1984, 2001, and 2014. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image74.png"
  },
  {
    "context": "The table below shows the consumption of three basic foods, rice, wheat and maize, by people in four different countries. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image72.png"
  },
  {
    "context": "Some people think that the best way to increase road safety is to increase the minimum legal age for driving cars or riding motorbikes. Do you agree or disagree with this opinion?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that governments should pay full course fees for students who want to study in universities. Do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries people increasingly talk about money (how much they earn or how much they pay for things) in their daily conversations. Why? Is this a positive or negative trend?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that success in sports depends on physical ability. Others believe that there are more important factors. Discuss both views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries not enough students are choosing to study science subjects. What are the causes? And what will be the effects on society?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that it's important to spend money on family celebrations (e.g. weddings, birthdays).  But something expensive  celebrations are a waste of money. Discuss and give opinions.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The graph below shows the percentages of tourists who used different types of transport to travel within a particular nation between 1989 and 2009. Each tourist may have used more than one type of transport. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image14.png"
  },
  {
    "context": "The chart below shows the annual pay (thousands of US dollars) for doctors and other workers in seven countries in 2004. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image16.png"
  },
  {
    "context": "The table below shows the average retirement age of males and females in six countries in 2003. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image17.png"
  },
  {
    "context": "The graph below gives information about computer possession per household in one European country between 1997 and 2011. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image47.png"
  },
  {
    "context": "People living in the 21st century have a better quality of life than the previous centuries. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe teenagers should focus on all subjects equally, whereas other people think that they should concentrate on only those subjects that they find interesting and they are best at. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people suggest that the government should spend money putting more works of art like paintings and statues into towns and cities to make them attractive places. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "More and more people today are spending large amounts of money on their complexions in order to look younger. Why do people want to look younger? Do you think this is a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The graph below shows the percentage of people by age group visiting the cinema at least once per month in one particular country between 1978 and 2008. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image31.png"
  },
  {
    "context": "The two plans below compare the layout of a typical Japanese office and a typical American office. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image23.png"
  },
  {
    "context": "The charts below give information about the world’s top three producers of four different dairy products in 2012. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image83.png"
  },
  {
    "context": "The table below shows the population ratio of females per 100 males in six different areas in 1995 and 2005. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image13.png"
  },
  {
    "context": "Many employees can now do their work from home using modern technology. However, this change may only benefit workers, not the employers. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Fewer and fewer people today write by hand using a pen, pencil or brush. What are the reasons for this?  Is the decline in writing by hand a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries, people decide to have children at a later age than in the past. Why? Do the advantages of this development outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Today, people are surrounded by advertising. This affects what people think is important and has a negative impact on people's lives. To what extent do you agree or disagree ?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The diagrams below show two cutting tools made from stone. They are from an early period and a later period of human history. The tools were made by breaking off small pieces of stone.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image42.png"
  },
  {
    "context": "The graph below shows unemployment levels in Ireland and the number of people leaving the country between 1988 and 2008. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image9.png"
  },
  {
    "context": "The three charts show the value in Australian dollars of Australian trade with three different countries from 2004 to 2009. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image56.png"
  },
  {
    "context": "The chart below shows the amount of money given to developing countries from five organisations from 2008 to 2011. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image63.png"
  },
  {
    "context": "In some countries, many children are becoming overweight and unhealthy. Some people say it is the responsibility of governments to solve this problem. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The increase in the production of consumer goods results in damage to the natural environment. What are the causes of this? What can be done to solve this problem?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people say that in the modern world, getting old is entirely bad. Others, however, say that life for the elderly nowadays is much better than it was in the past. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The best way to solve traffic and transportation problems is to encourage people to live in cities rather than suburbs and the countryside. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The maps below give information about a plan to redevelop an industrial site. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image60.png"
  },
  {
    "context": "The diagram below shows the process of growing and preparing pineapples and pineapple products. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image54.png"
  },
  {
    "context": "The first graph shows the number of train passengers from 2000 to 2009. The second graph shows the percentage of trains running on time. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image20.png"
  },
  {
    "context": "The chart below shows the results of three surveys on absenteeism in a particular European country in the years 2000, 2005 and 2010. The results show the reasons people gave for not going to work. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image46.jpg"
  },
  {
    "context": "Space travel has been possible for some time and some people claim that space tourism could be developed in the future. Do you think it is a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many students find it harder to study when they are at university or college than when they were at school. Why is this? What can be done to solve the problem?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It costs a lot of money for a country to host an international sports event, such as the Olympic Games or football World Cup. Some people think that this is a waste of money, while others believe the opposite.  Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that newspapers are the best way to learn about the news. However, others believe that they can learn the news more effectively through other media. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The table shows the frequency of adults using the internet in one European country from 2006 to 2010. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image55.png"
  },
  {
    "context": "The table below presents the food consumption per person weekly in European countries in 1992, 2002 and 2012. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image34.png"
  },
  {
    "context": "The graph below shows the value of clothing exported from Bangladesh between 1998 and 2012, and the pie chart shows the destinations and value of exported clothing in 2012. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image44.png"
  },
  {
    "context": "The diagram details the process of making wool. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image45.png"
  },
  {
    "context": "As transport and accommodation problems are increasing in many cities, some governments are encouraging businesses to move to rural areas. Do you think the advantages outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people claim that public museums and art galleries will no longer be necessary because people can see historical objects and works of art by using a computer. Do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people believe that good planning is the key factor to success in life, while others believe that other factors like hard work or luck are important. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "There are several factors that motivate people to stay in the workforce, and money is the most important factor. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The maps below show the layouts  of nature  Museum between 2010 and 2013. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image57.png"
  },
  {
    "context": "The chart below shows information about European people of different age groups who went to gym once a month or more between 1990 and 2010. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image80.png"
  },
  {
    "context": "The diagram below shows how oil is extracted in the production of perfume. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image10.png"
  },
  {
    "context": "The table below shows information about the population of New Zealand from 2011 to 2012 by age group. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image53.png"
  },
  {
    "context": "As well as making money, businesses also have social responsibilities. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people use written language in a less formal way and in a relaxed way than in the past.Why is that so? Does this development have more advantages or disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The most important function of music is that it helps people reduce stress. To what extent do you agree or disagree with this statement?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The table below gives information about salaries of secondary/high school teachers in five countries in 2009. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image49.png"
  },
  {
    "context": "The graph shows the number of people taking parts in 4 kinds of sports in a particular region between 1985 and 2005. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image51.png"
  },
  {
    "context": "The chart and table below give information about tourists at a particular holiday resort in Australia.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image62.png"
  },
  {
    "context": "The table below shows water use for different purposes in four countries (%). Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image39.png"
  },
  {
    "context": "In some countries today, many people decide to have their first child when they are older. What are the reasons? Do you think the advantages of this outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Whether or not a person achieves their aims in life is mostly related to luck. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "More and more people are becoming seriously overweight. Some people suggest that the solution to this problem is to increase the price of fattening foods. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "If old people are no longer physically, mentally or financially able to look after themselves, younger family members should be legally responsible for supporting them. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The chart below shows the percentages of males and females with higher education qualifications in five countries in 2001. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image6.png"
  },
  {
    "context": "The chart below shows the results of the survey of business people in three different years about factors that make managers good at their jobs. Respondents rated the factors from 1 to 5, according to the importance.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image24.png"
  },
  {
    "context": "The charts below give information about different types of waste disposed of in one country in 1960 and 2011. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image30.png"
  },
  {
    "context": "The diagram below shows the stages in processing cocoa beans. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image22.png"
  },
  {
    "context": "People aim to achieve a balance between their work and personal life, but few people achieve it. What are the causes of the problem? How to overcome it?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In some parts of the world it is increasingly popular to research the history of one’s own family. Why do people want to do this? Is it a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Large companies use sporting events to promote their products. Some people think this has a negative impact on sports. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Nowadays people depend on technology in their free time. Is this a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The maps show the changes made to a small museum and its surroundings in 1990 and 2010.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image48.jpg"
  },
  {
    "context": "The graph shows the value in US dollars (in millions of dollars) of investment in funds of four categories from 1988 to 2014. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image58.png"
  },
  {
    "context": "The table below shows the income and expenditure of  Harckley  Hall, a public place for hiring over the period of 3 years. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image38.png"
  },
  {
    "context": "The chart shows the percentage of people who accessed news from 4 sources from 1995 and projection to 2025. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image41.png"
  },
  {
    "context": "Nowadays, more people move away from their friends and families for work. Do the advantages outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people believe that schools should teach foreign languages for primary school children. Do the advantages of this outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Fewer young people do farming work in rural areas. Why? Should young people be encouraged to do farming work?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think scientific research should focus on solving world health problems. Others think that there are more important issues. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The graph below shows the unemployment rates in the UK, the rest of Europe and Japan from 1993 to 2007. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image32.png"
  },
  {
    "context": "The chart and graph below give information about three categories of workers in Australia and the unemployment levels within those groups.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image28.png"
  },
  {
    "context": "The graph below shows the percentage of Australian exports to four countries from 1990 to 2012.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/uploads/editor/study4/2024/11/30/pasted-image-0.png"
  },
  {
    "context": "Parents are putting a lot of pressure on their children to succeed. What are the reasons for this? Is it a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Many people put their personal information online (address, telephone number, and so on) for purposes such as signing up for social networks or online banking. Is this a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many countries today, if people want to find work, they have to move away from their families and friends. Do you think the advantages of this development outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The graph below shows the production levels of the main kinds of fuel in the UK between 1981 and 2000. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image69.png"
  },
  {
    "context": "The table below shows the number of temporary migrant workers in four countries in 2003 and 2006 and the number of these workers per 1,000 people in these countries in 2006.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image78.png"
  },
  {
    "context": "The diagram below shows how recycled paper is made. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image68.png"
  },
  {
    "context": "In some countries, students live with their family while studying at a university. In other countries, students attend university in another city. Do you think the advantages of living away from family home while attending university outweigh the disadvantages?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people want governments to spend money looking for life on other planets. Others, however, think this is a waste of public money when there are so many problems on earth. Discuss both these views and give your own opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "It is a natural process that animal species such as dinosaurs become extinct. There is no reason for people to prevent this from happening. Do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "In many parts of the world, some famous people are considered ‘role models', and they are having an increasing influence on the young. Is this a positive or negative development?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Bar Graph  The bar chart shows the percentage of school children learning to play different musical instruments in 2005, 2010, 2015. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image1.png"
  },
  {
    "context": "The picture below shows the difference in the layout of the conference  centre  in 2010 and 2025. Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image50.png"
  },
  {
    "context": "Some people say that too much time and resources are spent on the protection of wild animals and birds. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "Some people think that the government should strictly control the supply of fresh water, while others think we can use as much water as we want. Discuss both views and give your opinion.",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "More and more people are choosing to eat healthy food and exercise regularly. Why and what can we do to encourage this?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The two bar charts below show the proportion of 14-to 16-year-old students studying a foreign language in an English speaking country, and the top three foreign languages.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/ielts_writing_questions_22_24/images/image52.png"
  },
  {
    "context": "Many people believe that watching a live performance is more enjoyable than watching the same event on television. To what extent do you agree or disagree?",
    "task": 2,
    "diagram_url": null
  },
  {
    "context": "The graphs below give information about computer ownership as a percentage of the population between 2002 and 2010, and by level of education for the years 2002 and 2010.  Summarise the information by selecting and reporting the main features, and make comparisons where relevant.",
    "task": 1,
    "diagram_url": "https://s4-media1.study4.com/media/gg_imgs/test/57e375422b33f24019e322087667798213b9071e.jpg"
  },
  {
    "context": "A person’s worth nowadays seems to be judged according to social status and material possessions. Old-fashioned values, such as honour, kindness and trust, no longer seem important.  To what extent do you agree or disagree with this opinion?",
    "task": 2,
    "diagram_url": null
  }
]